In [1]:
import pandas as pd

In [7]:
#series
x=pd.Series([2,4,6,8,10])
x

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [11]:
x=pd.Series(['2','4','6','8'])
x

0    2
1    4
2    6
3    8
dtype: object

In [12]:
x.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
y=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
y

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
y['a']

1

In [16]:
y[0]

1

In [17]:
y/2

a    0.5
b    1.0
c    1.5
d    2.0
e    2.5
dtype: float64

In [21]:
y

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [22]:
y>1

a    False
b    False
c    False
d    False
e     True
dtype: bool

In [24]:
y[y == 1.25]

e    1.25
dtype: float64

In [30]:
z=pd.Series({'apple':10,'banana':20,'orange':20,'peach':40})
z

apple     10
banana    20
orange    20
peach     40
dtype: int64

In [29]:
z[z>30]

peach    40
dtype: int64

In [31]:
#只顯示不重複的
z.unique()

array([10, 20, 40], dtype=int64)

In [118]:
#dataframe
data1 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F']}
df1 = pd.DataFrame(data1)
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [33]:
#用LIST產生
data2 = [['Alan Chen', 23, 'M'], 
         ['Bob Yeh', 30, 'M'],
         ['Connie Ho', 38, 'F'],
         ['Daniel Chang', 27, 'M'],
         ['Ella Hsu', 45, 'F']]
df2 = pd.DataFrame(data2, columns=['name', 'age', 'sex'])
df2

           name  age sex
0     Alan Chen   23   M
1       Bob Yeh   30   M
2     Connie Ho   38   F
3  Daniel Chang   27   M
4      Ella Hsu   45   F

In [35]:
df1.columns

Index(['name', 'age', 'sex'], dtype='object')

In [36]:
df1.index

RangeIndex(start=0, stop=5, step=1)

In [37]:
df1.values

array([['Alan', 23, 'M'],
       ['Bob', 30, 'M'],
       ['Connie', 38, 'F'],
       ['Daniel', 27, 'M'],
       ['Ella', 45, 'F']], dtype=object)

In [40]:
df1['name']

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: name, dtype: object

In [41]:
df1[['name']]

     name
0    Alan
1     Bob
2  Connie
3  Daniel
4    Ella

In [42]:
df1.name

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: name, dtype: object

In [45]:
df1[['name','age']]

     name  age
0    Alan   23
1     Bob   30
2  Connie   38
3  Daniel   27
4    Ella   45

In [46]:
df1[['sex','age']]

  sex  age
0   M   23
1   M   30
2   F   38
3   M   27
4   F   45

In [49]:
df1[:3][['name','age']]

     name  age
0    Alan   23
1     Bob   30
2  Connie   38

In [51]:
df1 == 'F'

    name    age    sex
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False  False
4  False  False   True

In [52]:
df1[df1 == 'F']

  name  age  sex
0  NaN  NaN  NaN
1  NaN  NaN  NaN
2  NaN  NaN    F
3  NaN  NaN  NaN
4  NaN  NaN    F

In [54]:
df1['sex'] =='F'

0    False
1    False
2     True
3    False
4     True
Name: sex, dtype: bool

In [55]:
df1[df1['sex'] =='F']

     name  age sex
2  Connie   38   F
4    Ella   45   F

In [56]:
df1[df1['sex'] =='F']['age'].to_list()

[38, 45]

In [57]:
df1.head()

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [58]:
df1.tail()

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [59]:
df1.tail(2)

     name  age sex
3  Daniel   27   M
4    Ella   45   F

In [60]:
df1.head(2)

   name  age sex
0  Alan   23   M
1   Bob   30   M

In [61]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   sex     5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [62]:
df1.describe()

             age
count   5.000000
mean   32.600000
std     8.848729
min    23.000000
25%    27.000000
50%    30.000000
75%    38.000000
max    45.000000

In [63]:
df1[['name','sex']].describe()
#top顯示的出現最多次的那筆

        name sex
count      5   5
unique     5   2
top     Alan   M
freq       1   3

In [71]:
df1.drop('age',axis=1)

     name sex
0    Alan   M
1     Bob   M
2  Connie   F
3  Daniel   M
4    Ella   F

In [65]:
df1.drop('age',axis=1)
df1
#drop不會改到數值

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [66]:
del df2['age']

In [68]:
df2
#del: df2=df2.drop('age',axis=1)

           name sex
0     Alan Chen   M
1       Bob Yeh   M
2     Connie Ho   F
3  Daniel Chang   M
4      Ella Hsu   F

In [75]:
#iloc=index location
df1.iloc[0] #row

name    Alan
age       23
sex        M
Name: 0, dtype: object

In [77]:
df1[0]  #不能這樣抓

KeyError: 0

In [79]:
df1.iloc[0,1] #row,colum

23

In [80]:
df1.iloc[:3,0]

0      Alan
1       Bob
2    Connie
Name: name, dtype: object

In [81]:
df1.iloc[0,:2]

name    Alan
age       23
Name: 0, dtype: object

In [82]:
df1.iloc[[0,2,4],0]

0      Alan
2    Connie
4      Ella
Name: name, dtype: object

In [83]:
df1.iloc[[4,2,4],0]

4      Ella
2    Connie
4      Ella
Name: name, dtype: object

In [84]:
df1.iloc[[4,2,4],[0,1]]

     name  age
4    Ella   45
2  Connie   38
4    Ella   45

In [86]:
#loc location
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [90]:
df1.loc[:,'name']

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: name, dtype: object

In [93]:
df1.loc[:2,['name','sex']]

     name sex
0    Alan   M
1     Bob   M
2  Connie   F

In [94]:
df1.index=['a','b','c','d','e']

In [95]:
df1.loc[['a','b'],['name','sex']]

   name sex
a  Alan   M
b   Bob   M

In [98]:
df1.loc[:'d',['name','sex']]

     name sex
a    Alan   M
b     Bob   M
c  Connie   F
d  Daniel   M

In [99]:
df1.loc[df1.age>30]

     name  age sex
c  Connie   38   F
e    Ella   45   F

In [102]:
df1.loc[df1.age>30,'name']

c    Connie
e      Ella
Name: name, dtype: object

In [103]:
df1.loc[df1.age>30,['name']]

     name
c  Connie
e    Ella

In [105]:
df1.loc[df1.age>30,['age']] =99
df1

     name  age sex
a    Alan   23   M
b     Bob   30   M
c  Connie   99   F
d  Daniel   27   M
e    Ella   99   F

     name  age sex
a    Alan   23   M
b     Bob   30   M
c  Connie   99   F
d  Daniel   27   M
e    Ella   99   F

In [107]:
#math
df1.max()

name    Ella
age       99
sex        M
dtype: object

In [108]:
df1.mean()

<ipython-input-108-00fb6bfec183>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df1.mean()

age    55.6
dtype: float64

In [109]:
df1.sum()

name    AlanBobConnieDanielElla
age                         278
sex                       MMFMF
dtype: object

In [114]:
df1.cumsum()

                      name  age    sex
a                     Alan   23      M
b                  AlanBob   53     MM
c            AlanBobConnie  152    MMF
d      AlanBobConnieDaniel  179   MMFM
e  AlanBobConnieDanielElla  278  MMFMF

In [115]:
#str
df1['sex'].str.replace('M','Male')

a    Male
b    Male
c       F
d    Male
e       F
Name: sex, dtype: object

In [116]:
df1['sex']=df1['sex'].str.replace('M','Male')
df1

     name  age   sex
a    Alan   23  Male
b     Bob   30  Male
c  Connie   99     F
d  Daniel   27  Male
e    Ella   99     F

In [117]:
df1=df1['sex'].str.replace('M','Male')
df1

a    Maleale
b    Maleale
c          F
d    Maleale
e          F
Name: sex, dtype: object

In [120]:
#reset
df1['name'].str.upper()

0      ALAN
1       BOB
2    CONNIE
3    DANIEL
4      ELLA
Name: name, dtype: object

In [121]:
df1['name'].str.startswith('A')

0     True
1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [122]:
df1[df1['name'].str.startswith('A')]

   name  age sex
0  Alan   23   M

In [125]:
df2['name'].str.split(' ')

0       [Alan, Chen]
1         [Bob, Yeh]
2       [Connie, Ho]
3    [Daniel, Chang]
4        [Ella, Hsu]
Name: name, dtype: object

In [126]:
df2['name'].str.split(' ',expand=True)

        0      1
0    Alan   Chen
1     Bob    Yeh
2  Connie     Ho
3  Daniel  Chang
4    Ella    Hsu

In [130]:
df2['name'].str.split(' ',expand=True)[1]

0     Chen
1      Yeh
2       Ho
3    Chang
4      Hsu
Name: 1, dtype: object

In [132]:
df1['name'].str.contains('n')

0     True
1    False
2     True
3     True
4    False
Name: name, dtype: bool

In [133]:
df1[df1['name'].str.contains('n')]

     name  age sex
0    Alan   23   M
2  Connie   38   F
3  Daniel   27   M

In [134]:
#apply
df1['age'].apply(lambda x:'%.1f' % x)

0    23.0
1    30.0
2    38.0
3    27.0
4    45.0
Name: age, dtype: object

In [135]:
def f(series):
    return series -5

In [136]:
df1['age'].apply(f)

0    18
1    25
2    33
3    22
4    40
Name: age, dtype: int64

In [137]:
#sort
data3 = [[12, 25, 3, 34, 65],
         [65, 19, 28, 39, 10],
         [11, 19, 13, 34, 1]]
df3 = pd.DataFrame(data3, columns=['d', 'a', 'c', 'e', 'b'], index=['banana', 'apple', 'orange'])
df3

         d   a   c   e   b
banana  12  25   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

In [138]:
df3.sort_index()

         d   a   c   e   b
apple   65  19  28  39  10
banana  12  25   3  34  65
orange  11  19  13  34   1

In [139]:
df3.sort_index(ascending=False)

         d   a   c   e   b
orange  11  19  13  34   1
banana  12  25   3  34  65
apple   65  19  28  39  10

In [140]:
df3.sort_index(axis=1) #axis=0 row,axis=1 column

         a   b   c   d   e
banana  25  65   3  12  34
apple   19  10  28  65  39
orange  19   1  13  11  34

In [141]:
df3.sort_values(by='a')

         d   a   c   e   b
apple   65  19  28  39  10
orange  11  19  13  34   1
banana  12  25   3  34  65

In [142]:
df3.sort_values(by='a',ascending=False)

         d   a   c   e   b
banana  12  25   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

In [146]:
df3.sort_values(by=['a','b'],ascending=[False,True])

         d   a   c   e   b
banana  12  25   3  34  65
orange  11  19  13  34   1
apple   65  19  28  39  10

In [152]:
df3

         d   a   c   e   b
banana  12  25   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

In [153]:
#rank->排名次
df3.rank()

          d    a    c    e    b
banana  2.0  3.0  1.0  1.5  3.0
apple   3.0  1.5  3.0  3.0  2.0
orange  1.0  1.5  2.0  1.5  1.0

In [148]:
df3.rank(ascending=False) #反向排名

          d    a    c    e    b
banana  2.0  1.0  3.0  2.5  1.0
apple   1.0  2.5  1.0  1.0  2.0
orange  3.0  2.5  2.0  2.5  3.0

In [149]:
df3.rank(method='min') #改用3.0之前最小值，重複的才會影響

          d    a    c    e    b
banana  2.0  3.0  1.0  1.0  3.0
apple   3.0  1.0  3.0  3.0  2.0
orange  1.0  1.0  2.0  1.0  1.0

In [150]:
df3.rank(method='max') #改用3.0之前最大值，重複的才會影響

          d    a    c    e    b
banana  2.0  3.0  1.0  2.0  3.0
apple   3.0  2.0  3.0  3.0  2.0
orange  1.0  2.0  2.0  2.0  1.0

In [151]:
df3.rank(method='first') #重複時，先出現的排1.0，後出現的排2.0

          d    a    c    e    b
banana  2.0  3.0  1.0  1.0  3.0
apple   3.0  1.0  3.0  3.0  2.0
orange  1.0  2.0  2.0  2.0  1.0

In [155]:
#value_counts
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [156]:
df1['sex'].value_counts()

M    3
F    2
Name: sex, dtype: int64

In [158]:
df1['sex'].value_counts().sort_values()

F    2
M    3
Name: sex, dtype: int64

In [159]:
df1['sex'].value_counts().sort_values(ascending=False)

M    3
F    2
Name: sex, dtype: int64

In [160]:
#group by
data4 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F'],
        'dept': [1, 1, 1, 2, 2]}
df4 = pd.DataFrame(data4)
df4

     name  age sex  dept
0    Alan   23   M     1
1     Bob   30   M     1
2  Connie   38   F     1
3  Daniel   27   M     2
4    Ella   45   F     2

In [162]:
df4.groupby('sex').count()

     name  age  dept
sex
F       2    2     2
M       3    3     3

In [163]:
df4.groupby('sex').mean()

           age      dept
sex
F    41.500000  1.500000
M    26.666667  1.333333

In [164]:
df4.groupby('sex').min()

       name  age  dept
sex
F    Connie   38     1
M      Alan   23     1

In [165]:
df4.groupby('sex').max()

       name  age  dept
sex
F      Ella   45     2
M    Daniel   30     2

In [166]:
df4.groupby('sex').prod()

       age  dept
sex
F     1710     2
M    18630     2

In [167]:
df4.groupby('sex').std()

          age      dept
sex
F    4.949747  0.707107
M    3.511885  0.577350

In [168]:
df4.groupby('sex').var()

           age      dept
sex
F    24.500000  0.500000
M    12.333333  0.333333

In [169]:
df4.groupby(['sex','dept']).count()

          name  age
sex dept
F   1        1    1
    2        1    1
M   1        2    2
    2        1    1

In [170]:
df4.groupby(['sex','dept']).mean()

           age
sex dept
F   1     38.0
    2     45.0
M   1     26.5
    2     27.0

In [179]:
df4.groupby(['sex','dept']).mean(['name','age'])

           age
sex dept
F   1     38.0
    2     45.0
M   1     26.5
    2     27.0

In [180]:
df4.groupby(['sex','dept']).count()[['name']]

          name
sex dept
F   1        1
    2        1
M   1        2
    2        1

In [181]:
df4.groupby(['sex','dept']).count()[['name']].rename(columns={'name':'count'}) #name取代成count

          count
sex dept
F   1         1
    2         1
M   1         2
    2         1

In [183]:
df4.groupby(['sex','dept']).count()

          name  age
sex dept
F   1        1    1
    2        1    1
M   1        2    2
    2        1    1

In [184]:
df4.groupby(['sex','dept'],as_index=False).count() #整理成新資料

  sex  dept  name  age
0   F     1     1    1
1   F     2     1    1
2   M     1     2    2
3   M     2     1    1

In [185]:
df4.groupby(['sex','dept']).mean()

           age
sex dept
F   1     38.0
    2     45.0
M   1     26.5
    2     27.0

In [186]:
df4.groupby(['sex','dept']).agg(['mean','std'])

           age
          mean       std
sex dept
F   1     38.0       NaN
    2     45.0       NaN
M   1     26.5  4.949747
    2     27.0       NaN

In [189]:
df4.groupby(['sex','dept']).agg([('age','mean'),()])  #->看回放再補，第二節課末

AttributeError: 'SeriesGroupBy' object has no attribute 'age'

In [190]:
df4.groupby(['sex','dept']).describe()

           age
         count  mean       std   min    25%   50%    75%   max
sex dept
F   1      1.0  38.0       NaN  38.0  38.00  38.0  38.00  38.0
    2      1.0  45.0       NaN  45.0  45.00  45.0  45.00  45.0
M   1      2.0  26.5  4.949747  23.0  24.75  26.5  28.25  30.0
    2      1.0  27.0       NaN  27.0  27.00  27.0  27.00  27.0